tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
brew "act"
brew "aria2"
brew "autoconf"
brew "bat"
brew "bat-extras"
brew "biome"
brew "mpfr"
brew "gcc"
brew "btop"
brew "c-ares"
brew "fontconfig"
brew "glib"
brew "cmake"
brew "cmatrix"
brew "cocoapods"
brew "csvkit"
brew "dotter"
brew "eza"
brew "fastfetch"
brew "fastlane"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "gpg-tui"
brew "guile"
brew "harfbuzz"
brew "haste-client"
brew "helix"
brew "htop"
brew "httpie"
brew "httpstat"
brew "hyperfine"
brew "inetutils"
brew "ipcalc"
brew "jq"
brew "kondo"
brew "latexindent"
brew "lazygit"
brew "libgccjit"
brew "libnatpmp"
brew "mas"
brew "mise"
brew "mitmproxy"
brew "neovim"
brew "nmap"
brew "ollama", restart_service: true
brew "onefetch"
brew "openjdk"
brew "openssl@1.1"
brew "ouch"
brew "pandoc"
brew "pinentry-mac"
brew "rename"
brew "ripgrep"
brew "rustup-init"
brew "sd"
brew "sevenzip"
brew "shellcheck"
brew "speedtest-cli"
brew "spicetify-cli"
brew "sponge"
brew "starship"
brew "stow"
brew "subversion"
brew "swiftlint"
brew "texinfo"
brew "tlrc"
brew "tmux"
brew "trash"
brew "trunk"
brew "typst"
brew "wakeonlan"
brew "wget"
brew "wpscan"
brew "xdg-ninja", args: ["HEAD"]
brew "yt-dlp"
brew "zellij"
brew "zinit"
brew "zoxide"
cask "1password"
cask "1password-cli"
cask "aerial"
cask "alt-tab"
cask "arc"
cask "balenaetcher"
cask "bartender"
cask "beeper"
cask "brave-browser"
cask "brooklyn"
cask "cleanshot"
cask "cyberduck"
cask "devcleaner"
cask "discord"
cask "docker"
cask "expo-orbit"
cask "firefox@developer-edition"
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans"
cask "font-open-sans"
cask "font-source-sans-3"
cask "github@beta"
cask "handbrake"
cask "hoppscotch"
cask "hyperkey"
cask "iina"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "keka"
cask "keyboardcleantool"
cask "latest"
cask "linear-linear"
cask "lookaway"
cask "mac-mouse-fix"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "obs"
cask "obsidian"
cask "plex"
cask "proton-drive"
cask "proton-mail"
cask "protonmail-bridge"
cask "protonvpn"
cask "qlmarkdown"
cask "qlvideo"
cask "raycast"
cask "retroarch-metal"
cask "rotato"
cask "screen-studio"
cask "sf-symbols"
cask "shottr"
cask "slack"
cask "spotify"
cask "stats"
cask "syntax-highlight"
cask "tower"
cask "transmission"
cask "upscayl"
cask "utm"
cask "visual-studio-code"
cask "warp"
cask "whisky"
cask "xcodes"
cask "zed@preview"
cask "zoom"
